[
  {
    "image": "https://i.ibb.co.com/mVc3szw1/demo-app-1.webp",
    "title": "Super Cleaner",
    "companyName": "CleanTech",
    "id": 1,
    "description": "Super Cleaner is a comprehensive app designed to optimize your device and make it run smoothly. It efficiently cleans junk files, residual data, and cache to free up valuable storage space. The app monitors memory usage and boosts device performance instantly. It includes battery saver features to prolong battery life and prevent unnecessary drain. CPU cooling options help avoid overheating during heavy use. Super Cleaner also manages installed apps and suggests unused apps for removal. Privacy protection ensures that sensitive information is cleared safely. Scheduled cleaning options allow users to automate maintenance. The app is lightweight, fast, and easy to navigate, making it suitable for all users. Regular updates bring new features and improvements to keep your device optimized. It supports multiple Android versions and ensures seamless operation. With Super Cleaner, your phone stays organized, efficient, and faster. It enhances user experience by reducing lag and improving responsiveness. Users can enjoy smoother gaming, browsing, and multitasking. Download Super Cleaner to maintain your device's health effortlessly",
    "size": 25,
    "reviews": 150,
    "ratingAvg": 4.3,
    "downloads": 10000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 25 },
      { "name": "4 star", "count": 50 },
      { "name": "5 star", "count": 50 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN4NRg1H/demo-app-2.webp",
    "title": "Fit Tracker",
    "companyName": "HealthCorp",
    "id": 2,
    "description": "Fit Tracker is an all-in-one fitness app designed to help users monitor and improve their health. It tracks daily steps, calories burned, distance walked, and active minutes accurately. The app monitors heart rate, sleep patterns, and overall wellness to provide personalized insights. Users can set fitness goals, track progress, and receive motivational reminders. Fit Tracker supports workout plans, hydration tracking, and nutrition management. The app syncs seamlessly with other health apps for a holistic view of your wellness journey. Detailed reports and charts help users understand trends and patterns over time. Notifications encourage users to stay active and maintain consistency. The interface is user-friendly and suitable for beginners as well as fitness enthusiasts. Regular updates introduce new features and improvements to keep the app current. Fit Tracker is compatible with most Android and iOS devices. It motivates a healthier lifestyle by providing tips, challenges, and rewards. Users can track multiple metrics in one place for convenience. The app ensures data accuracy and reliability. Download Fit Tracker to start achieving your fitness goals today.",
    "size": 30,
    "reviews": 200,
    "ratingAvg": 4.6,
    "downloads": 50000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 20 },
      { "name": "4 star", "count": 60 },
      { "name": "5 star", "count": 105 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/2YSS08yQ/demo-app-3.webp",
    "title": "Photo Editor Pro",
    "companyName": "SnapSoft",
    "id": 3,
    "description": "Photo Editor Pro is a powerful app that allows users to edit photos like a professional. It offers a wide range of filters, effects, and adjustments to enhance images. Users can crop, rotate, resize, and straighten photos with ease. The app provides tools for adjusting brightness, contrast, saturation, and sharpness. It includes options for adding text, stickers, frames, and overlays to create unique designs. Portrait retouching tools help remove blemishes, smooth skin, and enhance features. Users can create collages using multiple images and artistic templates. The app supports high-resolution export and preserves image quality. Direct sharing options allow posting to social media platforms effortlessly. Photo Editor Pro features an intuitive interface that is easy to navigate. Undo and redo functions provide precise control over edits. Regular updates introduce new filters, effects, and creative tools. The app is optimized for smooth performance on most devices. Photo Editor Pro makes photo editing fun, fast, and professional. Enhance your creativity and produce stunning images anytime, anywhere.",
    "size": 50,
    "reviews": 500,
    "ratingAvg": 4.8,
    "downloads": 120000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 30 },
      { "name": "4 star", "count": 100 },
      { "name": "5 star", "count": 355 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/21mCsDDp/demo-app-4.webp",
    "title": "Note Keeper",
    "companyName": "NoteSoft",
    "id": 4,
    "description": "Note Keeper is an intuitive app that helps users organize their notes efficiently. It allows users to create, edit, and manage notes in one convenient place. The app supports text formatting, bullet points, and highlighting for better readability. Users can categorize notes into folders and add tags for easy retrieval. It includes search functionality to quickly find important information. Note Keeper also supports attaching images, voice notes, and documents to enrich content. Backup and restore options ensure that your data is safe. Reminders can be set to never forget important tasks or deadlines. The app is lightweight, fast, and easy to use, suitable for all ages. Regular updates bring new features and enhancements. Note Keeper improves productivity by keeping all essential information in one place. Users can share notes easily via email or messaging apps. The app ensures smooth performance on most devices. With Note Keeper, stay organized, focused, and efficient. Start managing your notes smarter today with Note Keeper.",
    "size": 15,
    "reviews": 90,
    "ratingAvg": 4.2,
    "downloads": 8000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 15 },
      { "name": "4 star", "count": 30 },
      { "name": "5 star", "count": 30 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4RQ8Znmc/demo-app-5.webp",
    "title": "Music Streamer",
    "companyName": "TuneWorld",
    "id": 5,
    "description": "Music Streamer is a versatile app that allows users to stream unlimited music anytime and anywhere. It features an extensive library of songs across all genres, from pop to classical. Users can create playlists, favorite tracks, and discover new music easily. The app supports high-quality audio streaming and offline downloads. Personalized recommendations help users explore music based on their taste. Music Streamer includes a radio feature for continuous music enjoyment. Users can share their favorite tracks and playlists with friends. The interface is clean, intuitive, and user-friendly. Regular updates ensure access to the latest hits and new features. The app is optimized for smooth performance on most devices. Music Streamer enhances the listening experience with equalizer and sound effects. It is compatible with both Android and iOS platforms. Users can enjoy seamless streaming with minimal buffering. Notifications alert users to new releases and trending tracks. Download Music Streamer to enjoy endless music and discover your next favorite song.",
    "size": 40,
    "reviews": 600,
    "ratingAvg": 4.7,
    "downloads": 200000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 150 },
      { "name": "5 star", "count": 370 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Language Learner",
    "companyName": "LinguaSoft",
    "id": 6,
    "description": "Language Learner is an engaging app designed to make learning new languages easy and fun. It offers interactive lessons, quizzes, and exercises to practice vocabulary and grammar. Users can listen to native speakers and improve pronunciation skills. The app supports multiple languages including Spanish, French, German, and more. Progress tracking helps users stay motivated and achieve learning goals. Gamified challenges make the learning process enjoyable and rewarding. Language Learner includes offline access to lessons for learning on the go. Users can set daily reminders to maintain consistent practice. The interface is intuitive, interactive, and suitable for learners of all ages. Regular updates introduce new lessons, features, and improvements. The app supports audio, text, and visual learning methods. Users can participate in language challenges and community forums. Language Learner encourages practical application of language skills in real-life situations. It ensures smooth performance and a seamless learning experience. Download Language Learner to expand your knowledge and communicate globally with confidence.",
    "size": 35,
    "reviews": 250,
    "ratingAvg": 4.5,
    "downloads": 70000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 12 },
      { "name": "3 star", "count": 30 },
      { "name": "4 star", "count": 90 },
      { "name": "5 star", "count": 110 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Weather Forecast",
    "companyName": "SkyNet",
    "id": 7,
    "description": "Weather Forecast is a reliable app that provides accurate and up-to-date weather information. It displays current conditions, hourly updates, and 7-day forecasts for any location. Users receive real-time alerts for severe weather, rain, or storms. The app includes radar maps, temperature, humidity, and wind speed details. It also offers sunrise and sunset timings for planning outdoor activities. Weather Forecast supports multiple locations and allows quick switching between cities. The interface is intuitive, clear, and easy to navigate. Widgets and notifications keep users informed at a glance. Regular updates enhance data accuracy and app performance. Users can save favorite locations for easy access. The app is lightweight and optimized for smooth operation. Weather Forecast provides weather insights for travel, sports, and daily routines. Users can share forecasts with friends and family. It includes detailed climate trends for better planning. Download Weather Forecast to stay prepared and enjoy your day without surprises.",
    "size": 20,
    "reviews": 300,
    "ratingAvg": 4.4,
    "downloads": 90000,
    "ratings": [
      { "name": "1 star", "count": 12 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 80 },
      { "name": "5 star", "count": 153 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Task Manager",
    "companyName": "ProductivityInc",
    "id": 8,
    "description": "Task Manager is a productivity app that helps users organize and manage their daily tasks efficiently. It allows creating, editing, and categorizing tasks with ease. Users can set deadlines, priorities, and reminders to ensure timely completion. The app supports recurring tasks and notifications for ongoing activities. Task Manager includes progress tracking and productivity reports. Collaboration features enable sharing tasks with friends or colleagues. Users can attach notes, images, and files to tasks for better context. The interface is clean, intuitive, and easy to use. Regular updates introduce new features and improvements. The app is lightweight and performs smoothly on most devices. Task Manager improves time management and reduces stress. Users can organize both personal and professional tasks in one place. It encourages consistency and efficiency through smart notifications. The app ensures data safety with backup and restore options. Download Task Manager to stay organized and productive every day.",
    "size": 22,
    "reviews": 180,
    "ratingAvg": 4.3,
    "downloads": 40000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 35 },
      { "name": "4 star", "count": 60 },
      { "name": "5 star", "count": 60 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Travel Guide",
    "companyName": "Wanderlust",
    "id": 9,
    "description": "Travel Guide is the ultimate app for planning trips and exploring new destinations. It provides detailed information on attractions, restaurants, hotels, and local transport. Users can create itineraries, track expenses, and set travel reminders. The app includes offline maps, directions, and location-based recommendations. Travel Guide offers personalized suggestions based on user preferences. Reviews and ratings help in making informed decisions. Users can share travel experiences and photos with friends and the community. The interface is user-friendly, intuitive, and suitable for travelers of all levels. Regular updates ensure accurate information and new features. The app supports multiple currencies and languages for international travel. Travel Guide enhances convenience by combining research, planning, and navigation in one app. It helps discover hidden gems and offbeat places. Notifications alert users about weather, events, and travel tips. The app ensures smooth performance and reliability. Download Travel Guide to explore the world with confidence and ease.",
    "size": 28,
    "reviews": 320,
    "ratingAvg": 4.6,
    "downloads": 110000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 80 },
      { "name": "5 star", "count": 185 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Recipe Book",
    "companyName": "CookMaster",
    "id": 10,
    "description": "Recipe Book is a comprehensive app for discovering and organizing recipes. It features thousands of recipes across different cuisines and dietary preferences. Users can search, filter, and save favorite recipes for easy access. The app provides step-by-step instructions, ingredient lists, and cooking tips. Recipe Book includes video tutorials and images to enhance the cooking experience. Users can create personalized meal plans and grocery lists. Sharing options allow posting recipes with friends and family. The interface is clean, intuitive, and easy to navigate. Regular updates add new recipes, features, and seasonal suggestions. Recipe Book supports offline access for convenience in the kitchen. Users can rate recipes and leave reviews for the community. It helps improve cooking skills and explore new flavors. Notifications alert users about trending recipes and tips. The app ensures smooth performance and minimal loading times. Download Recipe Book to become a better cook and enjoy delicious meals daily.",
    "size": 32,
    "reviews": 400,
    "ratingAvg": 4.7,
    "downloads": 150000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 12 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 120 },
      { "name": "5 star", "count": 210 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Budget Tracker",
    "companyName": "FinancePro",
    "id": 11,
    "description": "Budget Tracker is a smart app that helps users monitor expenses and manage finances effectively. It tracks income, spending, and savings automatically. Users can categorize transactions and generate detailed reports to understand spending habits. Budget Tracker supports setting financial goals and alerts for overspending. The app provides visual charts and graphs for easy analysis. Users can plan budgets monthly, weekly, or daily. Backup and restore options ensure data safety. The interface is simple, clean, and user-friendly. Regular updates add new features and enhance performance. Budget Tracker encourages savings and responsible spending. It supports multiple currencies and export options. Notifications help users stay on track with financial targets. The app is lightweight and optimized for smooth use. Users can share budget reports with family or advisors. Download Budget Tracker to take control of your finances and achieve financial goals.",
    "size": 18,
    "reviews": 220,
    "ratingAvg": 4.4,
    "downloads": 60000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 80 },
      { "name": "5 star", "count": 80 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Meditation App",
    "companyName": "MindWell",
    "id": 12,
    "description": "Meditation App is designed to help users relax, focus, and reduce stress through guided meditation sessions. It offers a variety of meditation techniques, including mindfulness, breathing exercises, and sleep meditations. Users can set daily meditation reminders to build a consistent practice. The app tracks progress and provides insights on stress levels and focus improvement. Meditation App includes calming music, nature sounds, and ambient tones. Users can create personalized meditation routines. The interface is serene, intuitive, and easy to navigate. Regular updates add new meditation sessions, features, and improvements. The app is lightweight and optimized for smooth performance. Users can join community challenges for motivation. Meditation App helps improve mental clarity, emotional well-being, and overall health. Notifications encourage regular practice and mindfulness. Offline access ensures meditations are available anytime. It supports multi-device synchronization. Download Meditation App to cultivate peace, focus, and balance in daily life.",
    "size": 24,
    "reviews": 350,
    "ratingAvg": 4.6,
    "downloads": 95000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 100 },
      { "name": "5 star", "count": 185 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Language Translator",
    "companyName": "GlobalTalk",
    "id": 13,
    "description": "Language Translator is a fast and accurate app that allows users to translate text, speech, and images instantly. It supports multiple languages from all over the world. Users can type, speak, or scan text to get accurate translations. The app includes offline translation for convenience when traveling. Language Translator also features pronunciation guides to improve speaking skills. Users can save frequent translations and create a personal phrasebook. The interface is simple, intuitive, and user-friendly. Regular updates add new languages, features, and improvements. The app is optimized for smooth performance and minimal delay. Notifications alert users to new phrases and language tips. Language Translator helps users communicate effectively while traveling or working internationally. It supports copy and share functions for easy usage. Users can practice pronunciation and learn phrases on the go. Download Language Translator to break language barriers and connect globally.",
    "size": 38,
    "reviews": 280,
    "ratingAvg": 4.5,
    "downloads": 80000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 90 },
      { "name": "5 star", "count": 125 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Workout Planner",
    "companyName": "FitLife",
    "id": 14,
    "description": "Workout Planner is a versatile app that helps users plan, track, and achieve their fitness goals. It provides personalized workout routines based on fitness level and goals. Users can track exercises, sets, reps, and progress over time. The app includes video demonstrations for correct exercise form. Workout Planner allows setting reminders and notifications for scheduled workouts. Users can monitor calories burned, heart rate, and overall progress. The interface is clean, intuitive, and easy to navigate. Regular updates bring new workouts, features, and challenges. The app supports offline access for workouts on the go. Workout Planner encourages consistency and accountability. Users can set weekly or monthly fitness goals and track achievements. The app is lightweight and optimized for smooth performance. Notifications motivate users to stay active and achieve results. Download Workout Planner to stay fit, active, and healthy every day.",
    "size": 26,
    "reviews": 210,
    "ratingAvg": 4.3,
    "downloads": 70000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 12 },
      { "name": "3 star", "count": 35 },
      { "name": "4 star", "count": 60 },
      { "name": "5 star", "count": 95 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Mind Games",
    "companyName": "BrainBox",
    "id": 15,
    "description": "Mind Games is a fun and challenging app designed to improve cognitive skills and mental agility. It offers a variety of puzzles, quizzes, and brain teasers suitable for all ages. Users can track progress and improve memory, focus, and problem-solving skills. The app includes daily challenges and timed exercises for motivation. Mind Games provides detailed statistics and performance reports. Users can compete with friends and participate in global leaderboards. The interface is colorful, interactive, and easy to navigate. Regular updates introduce new games, levels, and features. The app is lightweight and optimized for smooth gameplay. Mind Games encourages learning through fun and engagement. Users can improve mental flexibility, concentration, and critical thinking. Notifications alert users to new challenges and achievements. The app supports offline gameplay for convenience. Download Mind Games to have fun while exercising your brain every day.",
    "size": 45,
    "reviews": 500,
    "ratingAvg": 4.7,
    "downloads": 130000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 120 },
      { "name": "5 star", "count": 315 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Daily Planner",
    "companyName": "OrganizeIt",
    "id": 16,
    "description": "Daily Planner is a productivity app that helps users organize their daily schedules, tasks, and appointments. It allows creating, editing, and prioritizing tasks easily. Users can set reminders and notifications to never miss important events. The app supports recurring tasks, deadlines, and goal tracking. Daily Planner provides visual calendars and charts to monitor progress. Users can categorize tasks by work, personal, or custom labels. The interface is simple, clean, and intuitive. Regular updates bring new features, templates, and improvements. The app is optimized for smooth performance and low battery usage. Daily Planner helps improve time management and efficiency. Users can sync tasks across multiple devices. Sharing options allow collaboration with colleagues or family. The app supports offline access for planning anywhere. Download Daily Planner to stay organized, focused, and productive every day.",
    "size": 20,
    "reviews": 190,
    "ratingAvg": 4.4,
    "downloads": 55000,
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 15 },
      { "name": "3 star", "count": 35 },
      { "name": "4 star", "count": 60 },
      { "name": "5 star", "count": 70 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Video Editor",
    "companyName": "ClipMaster",
    "id": 17,
    "description": "Video Editor is a powerful app that enables users to create and edit professional-quality videos easily. It includes trimming, merging, and splitting video clips with precision. Users can add music, text, stickers, and effects to enhance videos. The app provides filters, transitions, and color correction options for creative editing. Video Editor supports high-resolution export and maintains video quality. Users can create slideshows and video collages effortlessly. The interface is intuitive, fast, and suitable for beginners and professionals. Regular updates introduce new editing tools, effects, and features. The app is optimized for smooth performance and minimal lag. Users can share videos directly on social media platforms. Video Editor supports multiple video formats and audio synchronization. Notifications provide tips and updates on new features. Download Video Editor to unleash your creativity and produce stunning videos anytime.",
    "size": 55,
    "reviews": 450,
    "ratingAvg": 4.8,
    "downloads": 140000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 120 },
      { "name": "5 star", "count": 265 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Expense Manager",
    "companyName": "MoneyWise",
    "id": 18,
    "description": "Expense Manager is a smart app that helps users track spending, manage budgets, and save money effectively. It records income and expenses automatically with detailed categorization. Users can set budget limits and receive alerts when exceeding them. The app provides visual charts, graphs, and reports for financial analysis. Expense Manager supports recurring payments and bill reminders. Users can attach notes, receipts, and files to transactions. The interface is clean, user-friendly, and intuitive. Regular updates bring new features and performance improvements. The app ensures secure backup and restore options for data safety. Expense Manager helps develop financial discipline and smart spending habits. Notifications provide insights on trends and tips for saving. The app supports multiple currencies and exporting options. It is optimized for smooth operation on most devices. Download Expense Manager to take control of your finances and improve money management daily.",
    "size": 30,
    "reviews": 220,
    "ratingAvg": 4.5,
    "downloads": 65000,
    "ratings": [
      { "name": "1 star", "count": 8 },
      { "name": "2 star", "count": 12 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 80 },
      { "name": "5 star", "count": 80 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Quiz Master",
    "companyName": "BrainyApps",
    "id": 19,
    "description": "Quiz Master is an engaging app that challenges users with quizzes across various topics and subjects. It offers multiple-choice questions, timed quizzes, and difficulty levels to suit all users. Users can track scores, progress, and achievements over time. The app includes daily quizzes and themed challenges for continuous learning. Quiz Master provides explanations for answers to enhance knowledge. Users can compete with friends, join leaderboards, and earn badges. The interface is colorful, interactive, and easy to navigate. Regular updates add new quizzes, topics, and features. The app is lightweight, optimized, and suitable for all devices. Quiz Master improves memory, focus, and cognitive skills. Notifications remind users of new quizzes and challenges. Users can participate in global competitions and learning events. Download Quiz Master to learn, have fun, and test your knowledge every day.",
    "size": 28,
    "reviews": 300,
    "ratingAvg": 4.6,
    "downloads": 90000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 90 },
      { "name": "5 star", "count": 145 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Bwgw1X/demo-app-6.webp",
    "title": "Shopping List",
    "companyName": "ShopEasy",
    "id": 20,
    "description": "Shopping List is a practical app that helps users create, manage, and organize their shopping needs efficiently. Users can add items, categorize them, and mark purchased products easily. The app supports recurring items, quantity tracking, and priority settings. It includes reminders to avoid missing important purchases. Shopping List provides syncing across multiple devices for family or group usage. Users can share lists via messaging apps or email. The interface is simple, clean, and intuitive. Regular updates add new features, themes, and improvements. The app ensures smooth performance and low resource usage. Shopping List helps save time, reduce errors, and plan shopping efficiently. Users can create multiple lists for different stores or occasions. Notifications keep track of items to buy. It supports offline access and quick edits. Download Shopping List to enjoy a stress-free and organized shopping experience every time.",
    "size": 16,
    "reviews": 150,
    "ratingAvg": 4.3,
    "downloads": 45000,
    "ratings": [
      { "name": "1 star", "count": 5 },
      { "name": "2 star", "count": 10 },
      { "name": "3 star", "count": 30 },
      { "name": "4 star", "count": 45 },
      { "name": "5 star", "count": 60 }
    ]
  }
]
